       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAMAXX.
      *=================================================================
      *==AUTOR: BRAULIO FIGUEIREDO       EMPRESA: XPTO
      *==OBJETIVO:
      *==DATA: XX/XX/XXXX
      *==OBSERVACOES:
      *=================================================================

       ENVIRONMENT              DIVISION.
       CONFIGURATION            SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       DATA                     DIVISION.
       WORKING-STORAGE          SECTION.

       PROCEDURE DIVISION.
       0100-RECEBE              SECTION.
       0200-MOSTRA              SECTION.
       0300-FINALIZAR           SECTION.
           STOP RUN.
