       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAMA01.
      *=================================================================
      *==AUTOR: BRAULIO FIGUEIREDO       EMPRESA: XPTO
      *==OBJETIVO: PRIMEIRO CONTATO COM COBOL
      *==DATA: 23/11/2025
      *==OBSERVACOES:
      *=================================================================

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
       0001-MAIN-PROCEDURE SECTION.
           DISPLAY "Hello Curso"
           DISPLAY "Hello Curso2"
           STOP RUN.
